Repository: nikkijuk/bmi-calculator-app
Catalog: lib/l10n/intl_*.arb
Languages: fi

# bmi_result
source: bmi is {bmi}
fi: bmi on {bmi}

# height
source: Length
fi: Pituus

# height_desc
source: Lenght in centimeters
fi: Pituus centtimetreinä

# level_n_name
source: Normal Weight
fi: Normaalipaino

# level_o1_name
source: Obese Class I
fi: Merkittävä ylipaino

# level_o2_name
source: Obese Class II
fi: Vaikea ylipaino

# level_o3_name
source: Obese Class III
fi: Sairaalloinen ylipaino

# level_po_name
source: Overweight
fi: Ylipaino

# level_t1_name
source: Mild Thinness
fi: Lievä alipaino

# level_t2_name
source: Moderate Thinness
fi: Merkittävä alipaino

# level_t3_name
source: Severe Thinness
fi: Sairaalloinen alipaino

source: not calculated
fi: ei laskettu

# title
source: BMI Calculator
fi: BMI Laskin

source: Weight
fi: Paino

# weight_desc
source: Weight in kilos
fi: Paino kiloina
